Repository: ArduanovDanil/test-sphinx
Catalog: docs/source/locale/*/LC_MESSAGES/general-usage.po
Languages: ru

source: General usage
ru: Общее использование

source: To hydrate existing object change string changed change:
ru: Заполнение существующего объекта из тестовое изменение:

source: To create a new object and fill it with the data:
ru: Создание нового объекта и заполнение его данными:

source: To pass arguments to the constructor of a nested object, use nested array or dot-notation:
ru: Для передачи аргументов в конструктор вложенного объекта используйте вложенный массив или запись «через точку»:

source: That would pass the `name` constructor argument of the `Car` object and create a new `Engine` object for `engine` argument passing `V8` as the `name` argument to its constructor.
ru: В примере выше в name передается аргумент конструктора объекта Car и создается новый объект Engine для аргумента engine, куда передается значение V8 как аргумент name конструктора.

source: Place
ru: Место

source: User
ru: Пользователь

source: Rating
ru: Рейтинг

source: Sasha
ru: Саша

source: Ivan
ru: Иван

source: [x] One
ru: [x] Один

source: [x] Two
ru: [x] Два

source: [ ] Three
ru: [ ] Три

source: [x] Three
ru: [x] Три

source: [ ] Four
ru: [ ] Четыре

source: ~~Hello, Ivan!~~\ Hello, Ivan!
ru: ~~Привет, Иван!~~\Привет, Иван!

source: Hellow, [Doka](https://doka.guide "Page about web-dev")!
ru: Привет, [Дока](https://doka.guide "Страница о web-dev")!

source: [Doka][1] have own [repository][repo].
ru: [Дока][1] имеет свой собственный [репозиторий][repo].

source: One
ru: Один

source: One One
ru: Один один

source: OneOneOne
ru: Один один один

source: OneOne
ru: Один один

source: See the [Using keys containing separator / shortcut] section for more details.
ru: Смотрите секцию [Using keys containing separator / shortcut] для более детальной информации.

source: Yii Validator
ru: Валидатор

source: A package for validating data.
ru: Пакет для валидации данных.

source: Guides
ru: Гайды

source: Validation
ru: Валидация

source: [Result](index.rst)
ru: [Результаты](index.rst)
